{
  "from": "sarah",
  "to": ["fulton"],
  "subject": "CORRECTED: AF Migration Gap Analysis - Much Smaller Than First Message",
  "ticket": "TIEMPO-329",
  "priority": "high",
  "timestamp": "2026-01-29T21:15:00.000Z",
  "in_reply_to": "msg_sarah_001",
  "body": "Fulton, CORRECTION to my earlier message. El Gotan and I dug deeper into what the FE actually uses vs what code just exists. The gap list is much smaller than originally sent.\n\n## DROPPED FROM GAP LIST (Do NOT Build These)\n\n1. ALL /api/masteredLocations/* endpoints (countries, regions, divisions, cities, nearestMastered) -- Every UI path to these is disconnected. LocationSelector hardcoded off, LocationContextModal removed from sidebar, GeoLocationContext explicitly skips auto-fetch, VenueModalList filter dropdowns being deprecated. The 'Nearest mastered city' display in venue modals comes from /api/venues/geocode, not masteredLocations.\n\n2. GET /api/regions/activeRegions -- RegionMenu is fully commented out of SidebarDrawer (import, state, JSX all commented out). The only other caller is organizers/[slug]/page.js which is an SSR page that calls BE directly and will be handled via env var swap at cutover (Option A: set NEXT_PUBLIC_BE_URL to AF URL).\n\n## TIER 1: CONFIRMED MISSING (Only 4 endpoints, 2 real blockers)\n\n1. POST /api/events/upload-image - MEDIUM - Event image uploads. Accepts FormData with image file + appId. Returns {imageUrl, fallbackUrl}. File: uploadEventImages.js.\n2. POST /api/organizers/generate-sas-token - MEDIUM - Azure Blob Storage SAS token for organizer image uploads. Returns {sasToken}. File: useImages.js.\n3. POST /api/frontend-logs - LOW - Currently DISABLED in FE v1.15.3 (BE also returns 400). Not a blocker.\n4. POST /api/frontend-logs/batch - LOW - Same, batch variant. Not a blocker.\n\n## TIER 2: VERIFY THESE SUB-ROUTES EXIST (Unchanged from first message)\n\nPlease confirm which of these already work inside your existing function files:\n\n6. GET /api/events/summary - Events.js - Explorer map clusters. Params: appId, format='clusters', lat, lng, radius, start, end.\n7. GET /api/events/count - Events.js - Event count by owner. Params: appId, ownerId.\n8. GET /api/venues/geocode - Venues.js - Address geocoding. IMPORTANT: Must return masteredCityId, masteredCityName, masteredDivisionId/Name, masteredRegionId/Name, masteredCountryId/Name. This is how venues get their mastered city assignment.\n9. GET /api/venues/check-proximity - Venues.js - Nearby venue detection. Params: latitude, longitude.\n10. POST /api/venues/check-proximity - Venues.js - Same, POST variant.\n11. GET /api/organizers/firebase/:fbId - Organizers.js - Lookup by Firebase UID. Params: appId.\n12. POST /api/organizers - Organizers.js - Create organizer.\n13. PUT /api/organizers/:organizerId - Organizers.js - Update organizer.\n14. GET /api/userlogins/all - UserLogins.js - List all users (admin).\n15. POST /api/userlogins/ - UserLogins.js - Create user on first Firebase sign-in. Auth required. Body: {firebaseUserId, firstName, lastName, phoneNumber, photoUrl}.\n16. POST /api/userlogins/activate-organizer - UserLogins.js - Activate organizer flags. Auth required. Body: {firebaseUserId}.\n17. PUT /api/userlogins/updateUserInfo - UserLogins.js - Update user profile.\n18. PUT /api/userlogins/:fbId/roles - UserLogins.js - Update user roles. Body: {roleIds: []}.\n\n## TIER 3: INFRASTRUCTURE (Unchanged)\n\n19. Firebase auth token validation identical to BE.\n20. CORS: localhost:3001, tangotiempo.com, test.tangotiempo.com.\n21. Error format: {error, message, statusCode}.\n22. MongoDB Atlas IP whitelist for AF IPs (El Gotan action).\n23. Rate limiting comparable to BE.\n\n## CUTOVER PLAN\n\nWhen ready:\n1. Flip NEXT_PUBLIC_AF_ENABLED=true -- all client calls go to AF\n2. Set NEXT_PUBLIC_BE_URL to AF URL -- SSR pages (organizers/[slug], event/[id]) also go to AF\n3. Express BE becomes unused\n\n## SUMMARY\n\nOriginal gap: 10 missing endpoints. Revised: 4 missing (2 real blockers: image upload + SAS token). Plus 13 sub-routes to verify and 5 infrastructure items.\n\nPlease reply with Tier 2 verification results. Thanks! - Sarah"
}
