{
  "from": "sarah",
  "to": ["fulton"],
  "cc": ["quinn", "gotan"],
  "subject": "TIEMPO-352: Root cause confirmed — AF missing 16 TZ display fields from Luxon/TimezoneService",
  "ticket": "TIEMPO-352",
  "priority": "urgent",
  "timestamp": "2026-01-31T00:00:00.000Z",
  "body": "Fulton,\n\nRoot cause of the TZ discrepancy is confirmed. This is the primary cutover blocker.\n\n## The Problem\n\nExpress computes 16 timezone display fields per event using Luxon 3.7.1 + TimezoneService (serverEvents.js lines 827-877). AF returns raw UTC dates from MongoDB with ZERO display fields.\n\nThe FE (transformEvents.js) uses these display fields to place events on the correct calendar day. Without them, it falls back to raw UTC startDate, shifting events forward by 5 hours (EST). Example: Vida Mia at 7:30 PM EST Friday (stored as 2026-01-31T00:30:00Z Saturday UTC) shows on Saturday.\n\n## The 16 Missing Fields\n\ndisplayStartTime, displayEndTime, timezoneAbbr, utcOffset, isDST, hasTimezoneData, venueStartDisplay, venueEndDisplay, venueAbbr, venueTZ, display.startTime, display.endTime, display.timezone, display.timezoneAbbr, display.utcOffset, display.isDST\n\n## What AF Needs\n\n1. Add Luxon dependency\n2. Port TimezoneService (319 lines in Express) or equivalent\n3. Compute the 16 display fields in Events GET response\n4. Match Express response shape exactly\n\n## Additional TZ Gaps Found\n\n- Venue TZ auto-detect: Express has timezoneMapping.js, AF has hardcoded America/New_York\n- Venue TZ cascade to events: Express bulk-updates future events on venue TZ change, AF doesn't\n- Event create: Express sets venueTimezone from venue, AF only handles isAllDay\n- VoiceEvents.js line 101: end-date padding hardcoded to 5AM UTC (midnight Eastern), breaks for other TZ\n- Events.js line 76: comment acknowledges need for TZ parity but no code\n\n## Combined Cutover Blockers (all on AF side)\n\n1. TIEMPO-352: 16 missing TZ display fields (THIS TICKET)\n2. /api/userlogins/* routes 404 on AF PROD v1.18.0\n3. /api/regions/activeRegions 404 on AF PROD v1.18.0\n4. AF PROD needs promotion to v1.20.1\n\nFull delta analysis posted as JIRA comment on TIEMPO-352. TIEMPO-353 closed as duplicate.\n\nLet me know if you need anything from the FE side.\n\n— Sarah"
}
