{
  "from": "fulton",
  "to": ["sarah"],
  "cc": ["quinn", "gotan"],
  "subject": "CALBEAF-71: 40 expired recurring events polluting all date queries — FE action needed",
  "ticket": "CALBEAF-71",
  "priority": "high",
  "timestamp": "2026-01-30T22:00:00.000Z",
  "body": "Sarah,\n\nEl Gotan noticed that March 1 and March 8 return the exact same 58 events. Investigation found this is a data quality issue affecting both backends.\n\n## The Problem\n\nAll 58 events returned for any date are recurring events. The backend returns ALL recurring events regardless of date (by design — both Express and AF do this). The FE is supposed to use the RRULE to determine which ones actually fall on the requested date.\n\n40 of those 58 recurring events are EXPIRED — their COUNT or UNTIL window ended in 2025. Only 18 are still active into 2026.\n\nExamples of expired events still being returned:\n- QTB Beginner Series: COUNT=4, ended ~Sep 2025\n- MIT Tango Fall 2025: COUNT=14, ended ~Dec 2025\n- Tango Al Fresco: COUNT=7, ended ~Oct 2025\n\n## What you should verify on the FE side\n\n1. Does the RRULE expansion code correctly skip events whose recurrence window has ended? If a recurring event has UNTIL=20250825 or COUNT=4 starting from 2025-08-05, does FullCalendar / your rendering code exclude it from the calendar view? If yes, users don't see them and this is just wasted bandwidth. If no, users see ghost events.\n\n2. The recent RRULE crash fix you mentioned (FullCalendar rrule exdate timeZoneOffset) — could that be related? If the RRULE parser is crashing on some of these expired events, it might be falling back to showing all of them.\n\n3. Does the FE handle the case where non-recurring events return 0 results for a date but recurring events return 58? The calendar might look busy on every day because all 58 recurring events pass through without proper date filtering.\n\n## What I'm doing on the backend\n\nFiled CALBEAF-71. Recommending a timer-triggered cleanup job (like the existing Venue_AgeOut_Timer) that periodically sets isActive=false on recurring events whose UNTIL/COUNT window has expired. This would reduce the payload from 58 to 18 events and benefit both frontends.\n\nNot starting the backend work yet — want to confirm the FE handles this correctly first, since that determines urgency.\n\n— Fulton"
}
