{
  "from": "fulton",
  "to": ["sarah"],
  "cc": ["quinn"],
  "subject": "v1.20.0 deployed to TEST — 2 fixes live, 2 issues are Express parity (not AF bugs)",
  "ticket": "TIEMPO-329",
  "priority": "high",
  "timestamp": "2026-01-30T19:30:00.000Z",
  "body": "Sarah,\n\nv1.20.0 is now on TEST. Here's the full status on the 4 issues you raised.\n\n## FIXED (2 issues — now live on TEST)\n\n**Issue 1: GET /api/events/count** — IMPLEMENTED\nNew endpoint in Events.js. Accepts appId + ownerId, returns { count }. Checks all 3 organizer ID fields (ownerOrganizerID, grantedOrganizerID, alternateOrganizerID) with isActive:true filter. useMigratedOrganizers.js should now get event counts instead of 404.\n\n**Issue 2: POST /api/venues/check-proximity** — IMPLEMENTED\nAdded POST method. Reads lat/lng/radius/appId from request body when POST, from query params when GET. VenueModalAddWithSearch.js should now work.\n\n**Bonus fix you didn't know about:** The GET check-proximity response shape was wrong. AF was returning raw MongoDB pipeline output with { distanceInYards (float), address1 } but Express maps these to { distance (rounded integer), address }. Fixed to match Express exactly.\n\n## NOT AF BUGS (2 issues — both backends behave identically)\n\n**Issue 3: Organizer default projection**\nYou said 'Express BE (Mongoose) returned ALL fields by default.' I checked the Express code (serverOrganizers.js line 788). Express has the SAME restrictive 11-field default projection:\n\n  const defaultSelect = '_id fullName shortName isActive isEnabled wantRender isVisible firebaseUserId organizerRegion masteredRegionId masteredDivisionId masteredCityId';\n\nBoth backends exclude description, publicContactInfo, images, createdAt, and organizerTypes from the organizer LIST endpoint. Both return the full document on GET-by-ID. AF already matches Express exactly here.\n\nIf the FE needs these fields on the list endpoint, either:\n(a) The FE should pass ?select=description,publicContactInfo,images,createdAt,organizerTypes to request them\n(b) Or this is a new enhancement needed on BOTH backends — not an AF migration gap\n\n**Issue 4: isApproved query filter**\nYou said 'The Express BE passed isApproved through to the MongoDB query.' I checked. Express also does NOT handle isApproved as a query parameter on the organizers GET endpoint. The field isApproved doesn't exist as a top-level field on the Organizer model at all — it only exists on the UserLogins model (regionalOrganizerInfo.isApproved).\n\nSending ?isApproved=true to either backend is silently ignored. AF matches Express exactly here too.\n\nIf filtering by organizer approval status is needed, that's a new feature for both backends — the FE would need to filter via the UserLogins data, not the Organizers collection.\n\n## SUMMARY\n\n| Issue | Status | Action |\n|-------|--------|--------|\n| events/count | FIXED in v1.20.0 | Verify on TEST |\n| POST check-proximity | FIXED in v1.20.0 | Verify on TEST |\n| check-proximity response shape | FIXED in v1.20.0 (bonus) | Verify on TEST |\n| Organizer projection | NOT AN AF BUG — Express identical | File as new enhancement if FE needs it |\n| isApproved filter | NOT AN AF BUG — Express identical | File as new enhancement if FE needs it |\n\nPlease re-verify issues 1 and 2 on TEST. You and Quinn are the arbiters for PROD promotion — let me know when you're satisfied.\n\n— Fulton"
}
